ac-about-dev
ac-fonts
ac-grid-icon-theme
ac-grub2-theme-vimix
ac-gtk-themepack
ac-hybrid-icon-theme
ac-lxdm-theme
ac-pixmaps
ac-wallpapers
adapta-gtk-theme
alacritty
alsa-plugins
alsa-tools
alsa-utils
amd-ucode
arc-gtk-theme
arc-icon-theme
arch-install-scripts
aspell
aspell-en
atril
autoconf
autojump-rs
automake
b43-fwcutter
base
betterlockscreen
biber
bind
binutils
bison
bmon
broadcom-wl
bspwm
btrfs-progs
calc
ccid
clang
clonezilla
cmus
colorpicker
compton-tryone-git
crda
cronie
darkhttpd
ddrescue
debtap
dhclient
dhcpcd
dialog
diffutils
dmidecode
dmraid
docker
dosfstools
downgrader-git
dpkg
dropbox
dua-cli
dunst
edk2-shell
efibootmgr
emacs
ethtool
exa
exfat-utils
expac
f2fs-tools
fakeroot
fd
feh
ffmpeg
ffmpegthumbnailer
firefox-developer-edition
fish
flameshot
fsarchiver
gcc
git-extras
git-quick-stats
github-cli
globalprotect
gnu-free-fonts
gnuplot
google-chrome
gparted
gpm
gptfdisk
grub-silent
gtk-engine-murrine
gvfs
gvfs-mtp
haveged
hdparm
htop
i3lock-fancy-multimonitor
imagemagick
inetutils
inotify-tools
intel-ucode
ipw2100-fw
ipw2200-fw
ispell
iwd
jdk8-openjdk
jfsutils
jq
kitty-terminfo
ksuperkey
languagetool
leafpad
lftp
libelogind
libuvc-git
lighttpd
linux
linux-atm
linux-firmware
linux-headers
lollypop
lsscsi
lvm2
lxappearance
lxdm-gtk3
lxdm-themes
lynx
make
man-db
man-pages
mc
mdadm
mdcat
midori
mkinitcpio
mkinitcpio-archiso
mkinitcpio-nfs-utils
mpc
mpd
mplayer
mtools
mupdf
nbd
ncdu
ncmpcpp
ndisc6
neofetch
neovim
nerd-fonts-dejavu-complete
nerd-fonts-hack
nerd-fonts-noto-sans-mono
network-manager-applet
networkmanager
networkmanager-dmenu-git
nfs-utils
nilfs-utils
nitrogen
nm-connection-editor
nmap
nodejs
noto-fonts
npm
ntfs-3g
ntp
numactl
nvme-cli
obconf
obmenu-generator
openbox
openconnect
openssh
openvpn
os-prober
p7zip
pacman-contrib
paprefs
partclone
parted
partimage
patch
pavucontrol
pcmanfm
pdfgrep
perl-datetime
perl-file-homedir
perl-linux-desktopfiles
perl-test-differences
perl-yaml-tiny
php-cgi
php-sqlite
pi-hole-server
pilorama-git
pkgconf
plank
plymouth
polkit
polybar
ppp
pptpclient
proselint
pulseaudio
pulseaudio-alsa
pv
pyenv
pyenv-virtualenv
python-pygments
qbittorrent
qt5-webkit
ranger
reflector
reiserfsprogs
ripgrep
rmapi
rmlint
rofi-git
rp-pppoe
rubber
rustup
rxvt-unicode-terminfo
scrot
sdparm
sg3_utils
shfmt
siji-git
slack-desktop
smartmontools
sof-firmware
soundcloud-dl-git
stow
sudo
sxhkd
syslinux
systemd-resolvconf
tcpdump
tcpreplay
teams
tectonic
terminus-font
termite-terminfo
testdisk
texlive-bibtexextra
texlive-core
texlive-fontsextra
texlive-formatsextra
texlive-games
texlive-humanities
texlive-latexextra
texlive-minionpro-git
texlive-music
texlive-myriadpro-git
texlive-pictures
texlive-pstricks
texlive-publishers
texlive-science
the_silver_searcher
thunar
thunar-archive-plugin
thunar-media-tags-plugin
thunar-volman
timew
tmux
tokei
tree
ttf-arphic-uming
ttf-baekmuk
ttf-dejavu
ttf-font-awesome
ttf-public-sans
ttf-unifont
tumbler
udisks2
unrar
unzip
usb_modeswitch
usbutils
viewnior
vim
vint
virtualbox
virtualbox-guest-utils
virtualbox-host-modules-arch
visual-studio-code-bin
vivid
vpnc
wget
which
wireless-regdb
wireless_tools
wireshark-git
wmctrl
wpa_supplicant
wvdial
xarchiver
xautolock
xclip
xdg-user-dirs
xdotool
xf86-video-intel
xfce4-power-manager
xfce4-settings
xfsprogs
xinit-xsession
xl2tpd
xmlstarlet
xorg-fonts-misc
xorg-server
xorg-xbacklight
xorg-xfd
xorg-xinit
xorg-xkill
xorg-xlsfonts
xorg-xrandr
xorg-xrdb
xorg-xsetroot
xsel
yad
yay
yubikey-manager
yubikey-personalization
yubikey-touch-detector
zathura
zathura-pdf-mupdf
zenity
zip
zola
zoom
zotero
zsh
